// Javascript
	// JS: 轻量级的客户端脚本编程语言

	// 1.编程语言
		// HTML+CSS是标记语言
		// 编程语言是具备一定逻辑的，拥有自己的编程思想（面向对象编程【oop】，面向过程编程）
		// - 面向对象
			// C++，JAVA，PHP，C#(.net dot net),js
		// - 面向过程
			// c

	// 2.目前的JS已经不仅仅是客户端语言了，基于NODE可以作服务端程序，所以JS是全栈编程语言

	// 3.学习JS，我们学习它的几部分组成
		// 1.ECMAScript（ES）: 描述了该语言的语法和基本对象
		// 2.DOM（document object model）：文档对象模型，描述处理网页内容的方法和接口。（提供各种API（属性和方法）让js可以获取或者操作页面中的HTML元素（DOM元素））
		// 3.BOM（browser object model）: 浏览器对象模型，描述与浏览器进行交互的方法和接口。（提供各种API，让JS可以操作浏览器）


// ESMAScript
	// 它是js的语法规划，js中的变量，数据类型，语法规范，操作语句，设计模式等等都是ES规定的
	